Repository: itsVLD/improved-succotash
Catalog: MeraInternship/translations/*/LC_MESSAGES/messages.po
Languages: ml

source: Login - Internship Portal
ml: പ്രവേശനം - ഇന്റേൺഷിപ്പ് പോർട്ടൽ

source: Find the best internships
ml: മികച്ച ഇന്റേൺഷിപ്പുകൾ കണ്ടെത്തൂ

source: Personalized recommendations • Track applications • Skill tests
ml: വ്യക്തിഗത ശുപാർശകൾ • അപേക്ഷകൾ പിന്തുടരുക • കഴിവ് പരീക്ഷകൾ

source: Internship
ml: ഇന്റേൺഷിപ്പ്

source: Internship Portal
ml: ഇന്റേൺഷിപ്പ് പോർട്ടൽ

source: Welcome Back
ml: മടങ്ങി സ്വാഗതം

source: Username or Email:
ml: ഉപയോക്തൃനാമം അല്ലെങ്കിൽ ഇമെയിൽ:

source: Password:
ml: പാസ്വേഡ്:

source: Log In
ml: പ്രവേശിക്കുക

source: New here?
ml: പുതിയവരായോ?

source: Register now
ml: ഇപ്പോൾ രജിസ്റ്റർ ചെയ്യുക

source: Main Menu - Internship Portal
ml: പ്രധാന മെൻു - ഇന്റേൺഷിപ്പ് പോർട്ടൽ

source: Dashboard
ml: ഡാഷ്ബോർഡ്

source: Profile
ml: പ്രൊഫൈൽ

source: Assessment Test
ml: അസസ്‌മെന്റ് ടെസ്റ്റ്

source: Application Management
ml: അപ്ലിക്കേഷൻ മാനേജ്മെന്റ്

source: Private Internships
ml: സ്വകാര്യ ഇന്റേൺഷിപ്പുകൾ

source: Government Internships
ml: സാർവജനം ഇന്റേൺഷിപ്പുകൾ

source: Logout
ml: ലോഗ്ഔട്ട്

source: Welcome,
ml: സ്വാഗതം,

source: Top picks for you
ml: നിങ്ങൾക്കായി എടുത്തെടുത്ത തസ്തികകൾ

source: Handpicked roles to match your skills
ml: നിങ്ങളുടെ കഴിവുകൾക്ക് അനുയോജ്യമായ തെരഞ്ഞെടുക്കപ്പെട്ട റോളുകൾ

source: Recommended
ml: ശുപാർശചെയ്തത്

source: Based on your profile
ml: നിങ്ങളുടെ പ്രൊഫൈലിന്റെ അടിസ്ഥാനത്തിൽ

source: Applied
ml: അപ്ലൈ ചെയ്‌തത്

source: Applications in progress
ml: അപ്ലിക്കേഷനുകൾ പുരോഗമിക്കുന്നു

source: Shortlisted
ml: ഷോർട്ട്‌ലിസ്റ്റ് ചെയ്‌തത്

source: Interview invites
ml: സাক্ষात्कार ക്ഷണങ്ങൾ

source: Search internships, companies, locations...
ml: ഇന്റേൺഷിപ്പുകൾ, കമ്പിനികൾ, സ്ഥലങ്ങൾ തിരയുക...

source: Search
ml: തിരയുക

source: Select a menu item to see content here.
ml: ഇവിടെ ഉള്ളടക്കം കാണാൻ ഒരു മെനു ഐറ്റം തിരഞ്ഞെടുക്കുക.

source: Internship Portal Profile
ml: ഇന്റേൺഷിപ്പ് പോർട്ടൽ പ്രൊഫൈൽ

source: User
ml: ഉപയോക്താവ്

source: Profile Pic
ml: പ്രൊഫൈൽ ചിത്രം

source: Change Photo
ml: ഫോട്ടോ മാറ്റുക

source: Jenny Wilson
ml: ജെന്നി വില്സൺ

source: New York, USA
ml: ന്യൂയോർക്ക്, യു.എസ്.എ.

source: XYZ University
ml: എക്‌സ് വൈ സ് യൂണിവേഴ്‌സിറ്റി

source: Specializations
ml: സ്പെഷ്യലൈസേഷനുകൾ

source: Add a skill
ml: ഒരു കഴിവ് ചേർക്കുക

source: Add Skill
ml: കഴിവു ചേർക്കുക

source: Account Details
ml: അക്കൗണ്ട് വിവരം

source: Username
ml: ഉപയോക്തൃനാമം

source: Enter username
ml: ഉപയോക്തൃനാമം നൽകുക

source: Email address
ml: ഇമെയിൽ വിലാസം

source: Enter your email
ml: നിങ്ങളുടെ ഇമെയിൽ നൽകുക

source: First name
ml: ആദ്യ പേരം

source: Last name
ml: അവസാന പേര്

source: Country
ml: ദേശം

source: Select a country
ml: ഒരു നഗരം തിരഞ്ഞെടുക്കുക

source: India
ml: ഇന്ത്യ

source: USA
ml: യു.എസ്.എ.

source: UK
ml: യു.കെ.

source: Australia
ml: ഓസ്ട്രേലിയ

source: Japan
ml: ജപ്പാൻ

source: City
ml: നഗരം

source: Select a city
ml: ഒരു നഗരം തിരഞ്ഞെടുക്കുക

source: Country Code
ml: രാജ്യ കോഡ്

source: India (+91)
ml: ഇന്ത്യ (+91)

source: USA (+1)
ml: യു.എസ്.എ. (+1)

source: UK (+44)
ml: യു.കെ. (+44)

source: Australia (+61)
ml: ഓസ്ട്രേലിയ (+61)

source: Japan (+81)
ml: ജപ്പാൻ (+81)

source: Phone Number
ml: ഫോൺ നമ്പർ

source: Enter phone number
ml: ഫോൺ നമ്പർ നൽകുക

source: University/College
ml: സര്‍വ്വകലാശാല/കാലജ്

source: University or College
ml: സര്‍വ്വകലാശാല അല്ലെങ്കില്‍ കാലജ്

source: Degree
ml: ഡിഗ്രി

source: Field of Study
ml: പഠനശ്രമഭാഗം

source: Graduation Year
ml: സ्नാതക വർഷം

source: LinkedIn Profile URL
ml: ലിങ്ക്ഡിൻ പ്രൊഫൈൽ URL

source: Portfolio/Website URL
ml: പോർട്ട്ഫോളിയോ/വെബ്‌സൈറ്റ് URL

source: Short Bio / About Me
ml: ചുരുക്കപ്പെട്ട ജീവചരിത്രം / എനിക്ക് കുറിച്ച്

source: Write something about yourself
ml: നിങ്ങളെ കുറിച്ച് എന്തെങ്കിലും എഴുതുക

source: Save changes
ml: മാറ്റങ്ങൾ സംരക്ഷിക്കുക

source: Register - Internship Portal
ml: രജിസ്റ്റർ - ഇന്റേൺഷിപ്പ് പോർട്ടൽ

source: Join Internship Portal
ml: ഇന്റേൺഷിപ്പ് പോർട്ടലിൽ ചേർക്കൂ

source: Create your account to access personalized internship recommendations and more.
ml: വ്യക്തിഗത ഇന്റേൺഷിപ്പ് ശുപാർശകൾക്കും മറ്റും പ്രവേശിക്കാനായി നിങ്ങളുടെ അക്കൗണ്ട് സൃഷ്‌ടിക്കുക.

source: Create Account
ml: അക്കൗണ്ട് സൃഷ്‌ടിക്കുക

source: Username or Email
ml: ഉപയോക്തൃനാമം അല്ലെങ്കിൽ ഇമെയിൽ

source: Enter your username or email
ml: നിങ്ങളുടെ ഉപയോക്തൃനാമം അല്ലെങ്കിൽ ഇമെയിൽ നൽകുക

source: Password
ml: പാസ്വേഡ്

source: Enter password
ml: പാസ്വേഡ് നൽകുക

source: Confirm Password
ml: പാസ്വേഡ് സ്ഥിരീകരിക്കുക

source: Confirm password
ml: പാസ്വേഡ് സ്ഥിരീകരിക്കുക

source: Register
ml: രജിസ്റ്റർ ചെയ്യുക

source: Already have an account?
ml: ഇതിനുമുന്‍പ് ഒരു അക്കൌണ്ട് ഉണ്ടോ?

source: Login here
ml: ഇവിടെ ലോഗിന്‍ ചെയ്യുക
